app/controllers/books_controller.rb

  def create
  	  @books = Book.all
  	  @book = Book.new(book_params)
  	  if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "てst"], ["body", "てst"], ["created_at", "2020-05-14 11:59:31.300586"], ["updated_at", "2020-05-14 11:59:31.300586"]]

  def update
  	  @book = Book.find(params[:id])
  	  if @book.update(book_params)
  	  	flash[:notice] = "Book was successfully updated"
  	  	redirect_to book_path(@book.id)
  	  else
  	  	@books = Book.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "てstaaa"], ["updated_at", "2020-05-14 12:45:35.199279"], ["id", 21]]
SELECT "books".* FROM "books"

  def destroy
  	  book = Book.find(params[:id])
  	  if book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 22]]